package kz.islamgylymhaly;

import android.os.Bundle;
import android.support.v7.app.ActionBarActivity;
import android.text.Html;
import android.text.method.ScrollingMovementMethod;
import android.view.MenuItem;
import android.widget.TextView;

/**
 * Created by Эльдар on 10.08.2015.
 */
public class Extra1 extends ActionBarActivity {

    final String termins = "Азан: Хабар беру, білдіру. Парыз намаз уақытын білдіретін арнайы сөздер.\n" +
            "Айн парыз: Жалпы парыз. Әрбір мұсылманға тікелей жүктеліп, өтеуге борышты парыздар.\n" +
            "Ақиқа құрбаны: Аллаһ Тағаланың нәсіп еткен перзентіне (жаңа сәбиге) шүкір ретінде шалынатын құрбандық мал.\n" +
            "Ақырғы отырыс: Соңғы рәкаттан кейінгі «әт-тахият» дұғасы оқылатын отырыс.\n" +
            "Атау, нәзір: Аллаһқа ғибадат мақсатымен өзіне тікелей міндет жүктелмесе де бір істі жасауға шешім қабылдап, осындай бір істі өзіне уәжіп ету мен Аллаһқа уәде беруі.\n" +
            "Әмин: Аллаһым, дұғамызды қабыл ет!\n" +
            "Әт-тахият: Намаз отырысында оқылатын дұға.\n" +
            "Әурет: Қарауы харам, жабылуы парыз мүшелер. Ер кісілер үшін кіндік пен тізенің арасы, әйелдер үшін бет-жүзі, білекке дейінгі екі қолы және тобыққа дейінгі екі аяғынан басқа барлық жерлері.\n" +
            "Әһли кітап: Аллаһтан кітап берілген еврей мен христиандар.\n" +
            "Балиғат шағы: Қыз баланың 9-15, ер баланың 12-15 жасқа келіп, кәмелетке толуы.\n" +
            "Бәни Һашим: Пайғамбарымыздың (с.а.у.) туыстары болып саналатын Һашим ұрпақтары.\n" +
            "Ғайру мүәккад сүннет: Пайғамбарымыздың (с.а.у.) кейде жасап, кейде жасамаған сүннеттері. Намаздыгер мен құптанның алғашқы сүннеттері, т.б.\n" +
            "Ғамус анты: Жалған ант. Бір нәрсені біле тұра әдейі жалған ант ету.\n" +
            "Ғиддәт: Әйел адамның күйеуінен талақ болғаннан кейін немесе күйеуі қайтыс болғаннан кейін күтетін белгілі уақыт.\n" +
            "Ғұсыл: Араб тілінде жуыну, шариғатта бүтін дененің арнайы түрде толық жуылуы.\n" +
            "Дәрет: Исламда кейбір ғибадаттарды іске асыру үшін және жеке басы да ғибадат саналатын арнайы тазалану түрі.\n" +
            "Жам’у тахир: Бірінші намаздың уақыты шыққаннан кейін екінші намаздың уақытында екі намазды бірге қосып оқу. Арафа күні ақшам және құптан намаздарын құптан уақытында Муздәлифәда бірге қосып оқу – уәжіп.\n" +
            "Жаназа намазы: Өлген мұсылманға оқылатын намаз түрі.\n" +
            "Жәйіз: Дінде рұқсат етілген жалпы іс-әрекеттер.\n" +
            "Жәмралар: Минада бір-біріне жақын арақашықта орналасқан тіктеулі тұрған үш шайтан тас. Бұл тіктеулі тастар: Кішкентей жәмра, Орта жәмра және Үлкен жәмра (Ақаба жәмра) деп аталады.\n" +
            "Жинаят: Қажылық немесе умра ғибадаттарындағы уәжіп амалдардың біреуінің орындалмай қалуы, тіпті белгіленген уақытынан кешіктірілуі немесе ихрамға кірген соң істелінуі харам тыйымдардың жасалуы.\n" +
            "Зиһар: Исламнан бұрынғы дәуірде араб әлемінде әйелдерді талақ етудің бір жолы.\n" +
            "Зиярат тауабы: Қажылардың Арафаттан қайтқаннан кейін жасайтын тауабына зиярат тауабы немесе «ифада тауабы» делінеді. Бұл тауапты жасау – қажылықтың үш парызының бірі. Зиярат тауабындағы жеті айналымның төртеуі – парыз, үшеуі – уәжіп.\n" +
            "Ибраһим мақамы: Қағбаны салу барысында Ибраһимнің (а.с.) аяғының ізі түскен тас. Қажылықта осы тұста арнайы намаз оқылып, ерекше зиярат жасалады.\n" +
            "Иғтиқаф: Бір жерде тұру, күту, өзін бір жерге қамау. Мешітте яки соған ұқсас жерде ғибадат ниетімен белгілі бір мезгіл сол жерде қалу.\n" +
            "Ижмағ: Ислам ғұламаларының белгілі бір мәселенің үкімінде ортақ көзқарасы.\n" +
            "Изар: Қажылықта белден төмен қарай жабатын сүлгі немесе мата.\n" +
            "Изар: Мәйітті орайтын кебіннің бірі.\n" +
            "Изтиба: Дененің үстіңгі жағындағы жапқыштың бір ұшын оң қолтықтың астынан өткізіп, сол иыққа тастап, оң қолды иықпен бірге ашық тастау.\n" +
            "Истибра: Кіші дәрет қалдықтарынан түгелдей арылу.\n" +
            "Истинжа: Қан, мәни, үлкен дәрет, кіші дәрет сияқты ластықтардан тазалану.\n" +
            "Истиншақ: Мұрыннан кеңсірікке дейін су тарту.\n" +
            "Истихара намазы: Бір істің жақсысын, қайырын, игілігін тілеу үшін арнайы оқылатын намаз және дұға.\n" +
            "Иттифақ: Ауызбірлігі.\n" +
            "Ифрад қажылығы: Миқатта ихрамға кірер кезде тек қана қажылық ғибадатының атқарылуы ниет етілетін қажылық түрі. Ифрад қажылығында умрасыз тек қана қажылық ғибадаты жасалады.\n" +
            "Ифтитах: Ашу, намаздың алғашқы тәкбірі.\n" +
            "Ифтитах: Намазды бастарда алынатын алғашқы тәкбір.\n" +
            "Ихрам: Қажылық немесе умра яки екеуін бірге жасау ниетімен, басқа уақыттағы халал кейбір істерді, қажылық немесі умра уақытында кісінің өзіне харам қылуы.\n" +
            "Ихсар: Дұшпанның бөгет болуына немесе ауру сияқты себептерге байланысты қажылық немесе умра жасау үшін ихрамға кірген адамның қажылықты немесе умраны аяқтамастан ихрамнан шығуға мәжбүр болуы.\n" +
            "Ихтилам: Ұйқыда ғұсылдың бұзылуы.\n" +
            "Иштиһад: Белгілі ережелерді ұстанып, Құран мен сүннеттен үкім шығару.\n" +
            "Кәффарат: Қателесіп, әдейі немесе біреудің зорлауы арқылы жасалған кейбір күнәлардың кешірілуінің Исламдағы арнайы өтелу жолдары.\n" +
            "Кифая парыз: Жалқы парыз. Жалпы мұсылманға парыз бола тұрса да, кейбір мұсылмандардың іске асыру арқылы барша мұсылманның мойнынан түсетін парыздар.\n" +
            "Кусуф: Күннің тұтылуы.\n" +
            "Кіші хадас: Дәретсіздік.\n" +
            "Қадум тауабы: Сырттан келетін адамдардың Меккеге келген уақытта Қағбаға сәлем ретінде жасайтын алғашқы тауап. Бұл тауапты жасау – сүннет.\n" +
            "Қамат: Парыз намазына тұрарда арнайы айтылатын азаннан аз ғана айырмашылығы бар сөз.\n" +
            "Қамис: Мәйітті орайтын кебіннің бірі.\n" +
            "Қиран қажылығы: Миқатта қажылықпен умраны бірге ниет етіп, бір ихраммен істелетін қажылық түрі. Умрасын тәмамдағаннан кейін ихрамнан шықпай қажылық амалдарын да сол ихраммен аяқтайды. Қиран қажылығында умра мен қажылықты бірге орындағаны үшін шүкір құрбанын шалу – уәжіп.\n" +
            "Қиям: Тіп-тік, түрегеп тұру. Намазда негізгі парыздардың бірі.\n" +
            "Құбыла: Меккедегі Қағба.\n" +
            "Құрбан: Араб тілінде «жақындау» деген мағынаны білдіреді. Ал шариғаттағы терминдік мағынасы – Аллаһ Тағаланың ризашылығына жақындау ниетімен құрбан айт күндерінде шалынатын арнайы малдың аты.\n" +
            "Қырағат: Намаздағы «Фатихадан» кейін оқылатын Құран. Ең қысқасы, үш аят немесе осы үш аяттың көлеміндей бір, яки екі аят.\n" +
            "Лағу анты: Қателесіп немесе айтқаным дұрыс деп ойлап ант ету түрі.\n" +
            "Лифафә: Мәйітті орайтын кебіннің бірі.\n" +
            "Мадмада: Ауызды сумен шаю.\n" +
            "Масбуқ: Имамға кешігіп ұйған.\n" +
            "Махрам: Исламда әйелдің үйленуі харам жақын туыстары.\n" +
            "Мәйіт: Бұл өмірден өткен адамның денесі.\n" +
            "Мәкрүһ: Жағымсыз, ұнамсыз, жаман іс-әрекет. Дәрет пен ғұсыл алғанда суды ысырап ету, т.б.\n" +
            "Мәсіх ету: Сүрту, сипау.\n" +
            "Миғраж: Хазіреті Пайғамбардың (с.а.у.) Ұлы Жаратушыға қарай көкке көтерілуі.\n" +
            "Миқат: Қажыға немесе умраға баратын адамдардың ихрамға кірмей өтуге рұқсат етілмеген арнайы жерлер.\n" +
            "Мирасқор: Өлген кісінің қалған малына иелік ететін артындағы туған-туыс, ұрпақтары.\n" +
            "Мисуак: Араб түбегінде өсетін, тісті тазалауда қолданылатын ағаш.\n" +
            "Муәллафатул-қулууб: Мұсылман болу бақытына әлі кенелмеген кейбір адамдардың жаманшылығынан сақтану үшін және Ислам дінін жаңадан қабылдаған иманы әлсіз адамдардың, тіпті әлі Исламды қабылдамаған кейбір адамдардың көңілін жібіту үшін кедей болсын, басқа болсын зекеттен белгілі есе беріліп отырған адамдар.\n" +
            "Муздәлифә: Арафат пен Минаның ортасында орналасқан жердің аты. Қажылықта Арафа күнінің құрбан айтқа қараған түнін толық Муздәлифәда өткізу – сүннет\n" +
            "Мун’ақид анты: Іске асу мүмкіндігі бар, жалпы болашаққа байланысты бір нәрсе жайлы ант ету.\n" +
            "Мұнафық: Күпірлігін жасырып, жұртқа мұсылман болып көрінген адам.\n" +
            "Мұстахап: Аллаһ Елшісінің (с.а.у.) кейде жасап, кейде жасамаған іс-әрекеттері. Сәске намазы секілді кейбір нәпіл намаз бен оразалар осыған жатады.\n" +
            "Мүәккад сүннет: Хазіреті Пайғамбарымыздың (с.а.у.) әрдайым жасап, ілуде жасамаған сүннеттері. Таң, бесін, ақшам намаздарының сүннеттері, т.б.\n" +
            "Мүбаһ: Жасалуы мен жасалмауында діни жағынан ешқандай тосқауыл болмаған, яғни жауапкердің еркіндегі іс-әрекеттер. Мәселен, тамақ ішу, ұйықтау, т.б.\n" +
            "Мүпсит: Басталған ғибадатты бұзатын нәрсе. Намазда өз-өзін ұстай алмай күлу, т.б.\n" +
            "Міскін: Түгі жоқ, мұқтаж адамдар.\n" +
            "Намаз: Тәкбірмен басталып, сәлеммен аяқталатын, ерекше қимылдар мен сөздерден тұратын ғажайып ғибадат.\n" +
            "Нәжісат: Ғибадаттың іске асуына кедергі жасайтын ластықтар.\n" +
            "Нәзір құрбаны: Белгілі шарттардың орындалуына байланысты немесе байланыссыз мұсылман баласының бір малды құрбандыққа шаламын деп, Аллаһ Тағалаға уәде етіп, уәденің уақыты келгенде шалатын малға «нәзір құрбаны» делінеді.\n" +
            "Нәпіл: Парыз бен уәжіптен тыс Аллаһ Тағалаға жақындау үшін жасалатын ғибадаттар.\n" +
            "Нәпіл тауап: Парыз және уәжіп болмаған нәпіл тауап.\n" +
            "Нисап: Зекетті, құрбан шалуды және пітір садақасын беруді парыз яки уәжіп ететін белгілі байлық мөлшері.\n" +
            "Нифас: Әйел адам босанған кезде жатырынан келетін қан.\n" +
            "Ораза: Екінші таң шапағынан бастап, күн батқанға дейін Аллаһ үшін ауыз бекіту.\n" +
            "Пақыр: Нисап мөлшеріне жететін байлықты иеленбеген адамдар.\n" +
            "Парыз: Анық және бұлтартпас дәлелдермен әмір етілген діни іс-әрекеттер мен міндеттер. Намаз оқу, ораза ұстау, зекет беру, т.б.\n" +
            "Пітір садақа: Күнделікті қолданылатын негізгі қажеттерінен тыс, кем дегенде, нисап мөлшері (85 г. алтын) байлыққа ие адамға уәжіп садақа.\n" +
            "Рәмәл: Тауаптың алғашқы үш айналымында иықтарды сілтіген бойда, қысқа адымдармен жылдам-жылдам жүру.\n" +
            "Рида: Қажылықта белден жоғары қарай жабатын сүлгі немесе мата.\n" +
            "Рүкүғ: иілу. Қолдарды тізеге қойып, төмен қарай иілу. Намаздың негізгі парыздарының бірі.\n" +
            "Рүкүн: Парыз, негіз.\n" +
            "Сағи: Араб тілінде шапшаң жүру, жүгіру деген мағынаны білдіреді. Ал шариғаттағы терминдік мағынасы: Мәсжидул-Харам жақта орналасқан Сафа және Мәруа төбелерінің арасында Сафа төбешігінен бастап, Мәруада аяқтау шартымен төрт рет барып, үш рет қайтып келу.\n" +
            "Салауат: Аллаһ Елшісіне (с.а.у.) айтылатын ерекше дұға.\n" +
            "Сәжде: Бағыну, мойынсұну, кішіпейілдікпен иілу. Маңдайды және мұрынды жерге тигізу «сәжде» деп аталады. Сәжде намаздың ішкі парызының бірі.\n" +
            "Сәләфи: Сахабалардан кейінгі ғалымдар.\n" +
            "Сәһу сәждесі: Қателік сәждесі.\n" +
            "Сүннет: Парыз бен уәжіптен бөлек Аллаһ Елшісі (с.а.у.) жасаған, «жасаңдар» деп әрі жасалуына ризалығын білдірген іс-әрекеттер.\n" +
            "Тағала: Ұлы, асқақ, жоғары. Аллаһтың ұлылығын білдіретін сөз. Әрі Аллаһ сөзін айтқанда, жазғанда қолданатын әдептілік белгісі.\n" +
            "Тағдил әркан: Намаздың ішкі парыздарын көңіл толатындай етіп, дұрыстап жасау.\n" +
            "Тауап: Қағбаны ғибадат ниетімен жеті рет айналу\n" +
            "Тахият дұғасы: Намаздың алғашқы отырысында және ақырғы отырысында оқылатын дұға.\n" +
            "Тахиятул-мәсжид: Мешітке сәлем беру деп аталатын мешітке кірген кезде отырмастан оқылатын намаз.\n" +
            "Тахримән мәкрүһ: Харамға жақын мәкрүһ. Дәрет алғанда суды ысырап ету, т.б.\n" +
            "Тәжһиз: Әзірлеу. Жаназаның жуылуынан көмілуіне дейін жасалатын діни істер.\n" +
            "Тәйәммүм: Су болмаған яки су бола тұрып, пайдалана алмаған кезде таза топыраққа соққан қолдары арқылы жүзі мен екі қолын шынтаққа дейін мәсіх етуі.\n" +
            "Тәлбия: Ихрамға кірер алдында айтылуы уәжіп болған және ихрамды болған уақытта молынан қайталанып айтылатын сүннет дұға. Ол дұға: «ЛәббайкАллаһумма ләббайк, ләббайка лә шәрика ләкә ләббайк, инналхамда уанниғмәтә ләкә уалмулка лә шәрика ләк. «Қазақша мағынасы: «Аллаһым, мен сенің әміріңді орындауға келдім, сенің әміріңе бой ұсындым (2 рет). Сенің серігің жоқ, сенің әміріңді орындау – менің борышым. Күмәнсіз, барлық мадақ саған тән және жалпы иелік пен нығмет сенікі. Сенің еш серігің жоқ».\n" +
            "Тәматтуғ қажылығы: Қаж айларында умра үшін ихрамға кіріп, умраны бітірген соң, сол жылғы Зилхижжаның сегізінші күні немесе одан да бұрын қажылық үшін қайтадан ихрамға кіру арқылы жасалатын қажылық түрі. Тәматтуғ қажылығында умра және қажылық үшін бөлек-бөлек ихрамға кіреді. Тәматтуғ қажылығында умра мен қажылықты бірге орындағандықтан шүкір құрбанын шалу – уәжіп.\n" +
            "Тәнзиһән мәкрүһ: Адалға жақын мәкрүһ. Мұрынды оң қолмен шаю, т.б.\n" +
            "Тәруия күні: Зилхижжа айының 8-інші күні.\n" +
            "Тәсбих: Аллаһ Тағаланы шірк атаулыдан, нұқсандықтан пәктеу.\n" +
            "Тәһажжүд намазы: Түннің жартысынан бастап, сәре уақытының аяқталуына дейінгі уақытта оқылатын намаз түрі.\n" +
            "Тәшәһһүд: әт-Тахият дұғасы оқылатын намаздың алғашқы және ақырғы отырысы.\n" +
            "Тіләуат сәждесі: Сәжде аяттарын естіген яки оқыған кезде арнайы жасалатын сәжде.\n" +
            "Уадағ (қоштасу) тауабы: Қажылықта Минада шайтанға тас лақтырғанан кейін Меккеге қайтқан кезде жасалатын тауап. «Садәр тауабы» деп те аталады. Қажылыққа сырттан келгендер үшін бұл тауапты жасау – уәжіп.\n" +
            "Уақфа: Бір мезет ғибадат ниетімен арнайы уақыттарда Арафат тауында және Муздәлифада тұру.\n" +
            "Уәжіп: Орындалуы дәл парыз секілді талап етілмеген, қуатты дәлелдермен анықталған іс-әрекет пен уазипалар. Құрбан шалу, үтір және айт намазын оқу, т.б.\n" +
            "Умра тауабы: Умраға барғанда жасалатын тауап. Бұл тауаптың алғашқы төрт айналымы – умраның парыздарынан, міндетті түрде жасалуы керек. Жасалмаса, умрасы дұрыс болмайды. Қалған үш айналым орындалмаса, арнайы жаза өтеледі.\n" +
            "Умра: Белгілі бір уақытқа байланбай жылдың кез келген уақытында ихрамға кіріп, тауап және сағи жасағаннан кейін шашты алғызып немесе қысқартып, ихрамнан шығу жолдарымен атқарылатын ғибадат.\n" +
            "Үзір қаны: Құрсақтан емес, ақау тамырдан ағатын қан.\n" +
            "Үлкен хадас: Жүніп, хайыз, нифас.\n" +
            "Фәтуа: Құран және сүннеттен белгілі бір ережелерге сүйеніп, шығарылатын үкімдер.\n" +
            "Хадасат: Рухани ластық. Ғұсылы, дәреті болмау, хайыз яки нифас жағдайы.\n" +
            "Хайыз: Әр айдың белгілі күндерінде әйелде пайда болып, кейбір ғибадаттарға кедергі жасайтын қан.\n" +
            "Харам аумағы: Өсімдіктерінің жұлынуына және аңдарының, жалпы жан-жануарларына зиян тигізуге тыйым салынған Мекке және оның айналасындағы қасиетті, мүбәрак жерлер.\n" +
            "Харам: Жасалуы мен пайдалануы Исламдық тұрғыдан қатаң тыйым салынған нәрселер. Ішімдік ішу, құмар ойындар, зина жасау, адам өлтіру, ғайбаттау, жала жабу, т.б.\n" +
            "Хусуф: Айдың тұтылуы.\n" +
            "Хұтпа: Жұма күні имамның парыз намазынан бұрын мінберге шығып оқитын дұғасы.\n" +
            "Һәди: Аллаһ Тағаланың ризалығы үшін немесе қажылық ғибадатындағы бір кемшілікке байланысты немесе ихрамның тыйымдарының біреуін бұзу салдарынан кәффарат ретінде Харам аумағында шалыну шартымен алынған, немесе ақшасы жіберілген құрбандық мал.\n" +
            "Шаут: Айналым. Қағбаны бір рет айналу – бір шаут, Сағи жасаған уақытта Сафадан Мәруаға бару – бір шаут, Мәруадан Сафаға қайта қайту – бір шаут)\n" +
            "Шейіт: Аллаһ жолында жанын пида еткен адам.\n";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_extra1);

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        TextView termin = (TextView) findViewById(R.id.termin);

        int i = 0;
        String st = "";
        while (i < termins.length()) {
            int pos = 0;
            String s = "";
            while (termins.charAt(i) != '\n') {
                s += termins.charAt(i);
                i++;
            }
            for (int j = 0; j < s.length(); ++j)
                if (s.charAt(j) == ':') {
                    pos = j;
                    break;
                }
            st += "<b>" + s.substring(0, pos+1) + "</b>" + "<i>" + s.substring(pos+1, s.length()) + "</i>" + "<br/>";
            i++;
        }

        termin.setText(Html.fromHtml(st));
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        int id = item.getItemId();
        if (id == android.R.id.home) onBackPressed();
        return super.onOptionsItemSelected(item);
    }
}
