package kz.islamgylymhaly;

import android.os.Bundle;
import android.support.v7.app.ActionBarActivity;
import android.text.Html;
import android.text.method.ScrollingMovementMethod;
import android.view.MenuItem;
import android.widget.TextView;

/**
 * Created by Эльдар on 10.08.2015.
 */
public class Extra2 extends ActionBarActivity {

    final String s = "1. Абдулхаким Юже. Геже ибадеті, Измир.\n" +
            "2. Абдул-Хамид Махмуд Тохмаз. Әл-фиқһул-ханафи фи сәубиһил-жәдид. Димашқ, 1998.\n" +
            "3. Ахмәд ибн Ханбәл. Муснәд. Египет, 1949.\n" +
            "4. Әбу Дәууд. Суләйман ибн әс-Сижистани. Сунән. Египет, т.\n" +
            "5. Әш-Шәукәни. Мухаммәд ибн Али. Нәйлу’л-Әутәр фи Шәрхи Мултәкәл’-Ахбар. Египет, т.\n" +
            "6. Бухари, Әбу Абдиллаһ Мухаммед ибн Исмайл. Әл-Жами’ус-Сахих, Станбул, 1907.\n" +
            "7. Білмен, Өмер Насухи. Бүйүк Ислам Илмихали. Станбул, 1967.\n" +
            "8. Дарими, Әбу Мухаммәд ибн Абдуррахман. Сунән, Египет, т.\n" +
            "9. Жәләл Иылдырым. Кайнакларыйла Ислам фиқһы, Кония.т.\n" +
            "10. Зәйлаи, Хафз Абдуллаһ ибн Юсуф. Насбур-Раиә ли Ахадиси Һидаиә. 1973.\n" +
            "11. Зухайли. Әл-Фиқул-Ислами уә Әдиллатуһ, Димашқ, 1985.\n" +
            "12. Ибн Абидин, Мухаммәд Әмин. Рәддул-Мухтар, Египет. т.\n" +
            "13. Ибн Мажә.Әбу Абдиллаһ Мухаммәд ибн Иазид. Сунән. 1952.\n" +
            "14. Ибраһим Жанан. Кутубу Ситта. Станбул.\n" +
            "15. Исмайл Мутлы. Куран ве суннет ышыгында.\n" +
            "16. Кәсани, Алауиддин Әбу Бәкр ибн Мәс’ууд. Бәдәәи´с-Санаа’и фи Тәртбиш-шәрәә’и. Бәйрут. 1997.\n" +
            "17. Малик ибн Әнас. Муатта. Египет, 1951.\n" +
            "18. Муслим. Әбул Хусәйн ибн Хажжаж. Сахих. Станбул, 1973.\n" +
            "19. Мұхитдин Исаұлы. «Жайнамаз». Қазақ әдебиеті, 2002.\n" +
            "20. Нәсаии,Әбу Абдрахман ибн Шуаиб.Сунән. Египет,т.\n" +
            "21. Рахматуллаһи Абдунғаний Ибараһим Халил, Нақлул ихтилаф биқасдил-и′тиләф, 223-бет. Сауд Арабия, Әл-мактабатул-мәккиаһ. 2000 ж.\n" +
            "22. Сафвет Сених. Құлшылық құпиясы. (ауд: Қ.Бағашар) Алматы, 2006ж.\n" +
            "23. Тирмизи, Мухаммәд ибн Иса. Сунән.1937.\n" +
            "24. Халифа Алтай, Құран Кәрим қазақша мағына және түсінігі, Сауд Арабия, 1991.\n" +
            "25. Хамди Дөндерен. Делиллериле Ислам Илмихалы. Станбул, 1991.\n" +
            "26. Хәйсәми, Нуриддин Али ибн Әбу Бәкр. Мәжмә’уз-Зәуәид, Египет,т.";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_extra2);

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        TextView text = (TextView) findViewById(R.id.textView);
        text.setText(s);
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        int id = item.getItemId();
        if (id == android.R.id.home) onBackPressed();
        return super.onOptionsItemSelected(item);
    }
}
